virgiawan/app/Controllers/Category.php

    public function index($id = false)
    {
        $data = [
            'appName' => $this->appName,
            'title' => 'Category',
            'hero' => 0,
            'request' => $this->request,
            'category' => $this->M_category->paginate('4', 'category'),
---
SELECT *
FROM `category`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `category`