virgiawan/app/Controllers/Home.php

SELECT *
FROM `category`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `category`
---
    public function index()
    {
        $data = [
            'appName' => $this->appName,
            'title' => 'Home',
            'hero' => 1,
            'category' => $this->M_category->paginate('4'),