virgiawan/app/Controllers/Product.php

SELECT *
FROM `category`
---
    public function add()
    {
        $data = [
            'appName' => $this->appName,
            'title' => 'Add Product',
            'hero' => 0,
            'request' => $this->request,
            'category' => $this->M_category->findAll(),

SELECT *
FROM `category`
---
    public function edit($id)
    {
        $data = [
            'appName' => $this->appName,
            'title' => 'Edit Product',
            'hero' => 0,
            'request' => $this->request,
            'category' => $this->M_category->findAll(),